Revit 2027 API
BuiltInFailures.OverlapFailures.FloorsOverlap Property
 Highlighted floors overlap.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FloorsOverlap { get; }
Public Shared ReadOnly Property FloorsOverlap As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FloorsOverlap {
	FailureDefinitionId^ get ();
}
static member FloorsOverlap : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.OverlapFailures Class
Autodesk.Revit.DB Namespace